no, there are situations where if we do not give query parameter for REDIRECT URI, it does not take the default instead it says it will recreate my resource...why does that happen?? 

this error disappears when i add query = "?{query}" isnt that an optional parameter and a default value?

Example:

  # oci_load_balancer_rule_set.lb will be updated in-place
  ~ resource "oci_load_balancer_rule_set" "lb" {
        id               = "loadBalancers/ocid1.loadbalancer.xxxxxxxxxxxxxxxxaq/ruleSets/lb"
        load_balancer_id = "ocid1.loadbalancer.xxxxxxxxxxxxxxxaq"
        name             = "lb"

      + items {
          + action                         = "REDIRECT"
          + allowed_methods                = (known after apply)
          + are_invalid_characters_allowed = (known after apply)
          + description                    = (known after apply)
          + header                         = (known after apply)
          + http_large_header_size_in_kb   = (known after apply)
          + prefix                         = (known after apply)
          + response_code                  = 302
          + status_code                    = (known after apply)
          + suffix                         = (known after apply)
          + value                          = (known after apply)

          + conditions {
              + attribute_name  = "PATH"
              + attribute_value = "/*"
              + operator        = "PREFIX_MATCH"
            }

          + redirect_uri {
              + host     = "{host}"
              + path     = "/{path}"
              + port     = 443
              + protocol = "https"
              + query    = (known after apply)
            }
        }
      - items {
          - action                         = "REDIRECT" -> null
          - allowed_methods                = [] -> null
          - are_invalid_characters_allowed = false -> null
          - http_large_header_size_in_kb   = 0 -> null
          - response_code                  = 302 -> null
          - status_code                    = 0 -> null

          - conditions {
              - attribute_name  = "PATH" -> null
              - attribute_value = "/*" -> null
              - operator        = "PREFIX_MATCH" -> null
            }

          - redirect_uri {
              - host     = "{host}" -> null
              - path     = "/{path}" -> null
              - port     = 443 -> null
              - protocol = "https" -> null
              - query    = "?{query}" -> null
            }
        }

        timeouts {}
    }
